// let quets = [
//     'شکست خوردن سخت است اما سخت تر از شکست آن است که هرگز برای موفقیت تلاش نکنیم. “تئودور روزولت”',
//     'من امروز انسان موفقی هستم زیرا دوستی داشتم که به من اعتقاد داشت و نمی خواستم او را نا امید کنم. “آبراهام لینکلن”',
//     'اجازه دهید همیشه با لبخند با هم روبرو شویم، زیرا لبخند سرآغاز عشق است. “مادر ترزا”',
//     'انتخاب هایی که در طول زندگی می کنیم بیشتر از توانایی های ما حقیقت وجودی مان را نشان می دهند. “جی کی رولینگ”',
//     'فقط زمانی کاری را به فردا موکول کن که برایت اهمیت نداشته باشد که بمیری و انجامش نداده باشی. “پابلو پیکاسو”',
//     'اگر می خواهی خوشحال باشی، پس باش. “لئو تولستوی”',
//     'اغلب شکست های زندگی برای افرادی رخ داده که موقع تسلیم شدن نمی دانستند چقدر به موفقیت نزدیک شده اند. “توماس ادیسون”',
//     'اگر می خواهید زندگی شادی داشته باشید، زندگی خود را به یک هدف گره بزنید نه آدم ها و چیزها. ” آلبرت انیشتین”',
//     'اگر کارتان خوردن یک قورباغه است بهتر است اول صبح انجامش دهید، اگر کارتان خوردن دو قورباغه است، بهتر است ابتدا قورباغه بزرگ تر را بخورید. “مارک تواین”',
//     'آنچه را که به آن علاقه دارید پیدا کنید، در آن خبره شود سپس کسی را پیدا کنید که به خاطر آن تخصص به شما دستمزد دهد. “کاترین وایتهورن”',
//     'زندگی همه انسان ها یکسان به پایان می رسد، تنها نحوه زندگی کردن و نحوه مرگ افراد است که باعث تمایز آن فرد با دیگران می شود. “ارنست همینگوی”',
//     'هر کاری که می توانید یا آرزوی انجام دادنش را دارید شروع کنید زیرا جسارت با خود نبوغ، قدرت و جادو به همراه می آورد. “ولفانگ گوته”',
//     'معتقدم هر کسی قدرت درونی ای دارد که برنده و بازنده را می سازد و برنده ها کسانی هستند که واقعا به حقیقت قلب شان گوش می دهند. “سیلوستر استالونه”',
//     'در زندگی مهم این نیست که به ایده آل زندگی تان برسید، بلکه مهم این است که در مسیر رسیدن به ایده آل زندگی تان حرکت کنید. “دکتر الهی قمشه ای”'   
// ]

const quotes = [
    {
        name: 'تئودور روزولت',
        quote: 'شکست خوردن سخت است اما سخت تر از شکست آن است که هرگز برای موفقیت تلاش نکنیم.'   
    },
    {
        name: 'آبراهام لینکلن',
        quote: 'من امروز انسان موفقی هستم زیرا دوستی داشتم که به من اعتقاد داشت و نمی خواستم او را نا امید کنم.'
    },
    {
        name: 'لئو تولستوی',
        quote: 'اگر می خواهی خوشحال باشی، پس باش.'
    },
    {
        name: 'توماس ادیسون',
        quote: 'اغلب شکست های زندگی برای افرادی رخ داده که موقع تسلیم شدن نمی دانستند چقدر به موفقیت نزدیک شده اند'
    }    
]



let pQuote = document.getElementById("pQuots")
let nextBtn = document.getElementById('nextBtn') 
let nameOfQuote = document.getElementById('nameOfQuote')
 
function randQuets() {
    let randomNum = Math.floor(Math.random() * quotes.length)    
    pQuote.innerText = quotes[randomNum].quote 
    nameOfQuote.innerText = quotes[randomNum].name

}
randQuets()

 nextBtn.addEventListener('click',randQuets)
        
